<?php

namespace Database\Seeders;

use App\Models\Blog;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $blog = new Blog();
        $blog->naslov = "Пријаве за семинар за средњошколце RAF IT Days 2025 су у току!";
        $blog->sadrzaj = "Тестирање средњошколаца за петнаести IT семинар – RAF IT Days је почело и трајаће до 20. марта 2025. године. Семинар RAF IT Days 2025 одржаће се на Рачунарском факултету. Сви кандидати су у обавези да одраде ТЕСТ, а најуспешнији добијају позив да присуствују семинару. Семинар организује Рачунарски факултет са жељом да младима што више приближи информационе технологије, њихов напредак и примену у привреди.

        Ово је јединствена прилика да се ученици упознају са начином рада у IT индустрији и добију корисне информације и савете од искусних професионалаца. Компаније се радо одазивају позиву за дружење са средњошколцима, а то су до сада учиниле: Microsoft Development Center Serbia, Nordeus, Adobe, Google, Oracle, Godaddy, CET, Infostud и многе друге. Семинар ће трајати четири дана, а одржаће се од 4. до 7. априла 2025. године.

        За питања нам се обратите мејлом на: rafitdays [@] raf.rs";
        $blog->save();

        Blog::create([
            "naslov" => "Такмичење RAF Challenge 2025 је почело",
                "sadrzaj" => "На сајту Рачунарског факултета објављен је позив средњошколцима за учешће на информатичком такмичењу RAF Challenge које организују Рачунарски факултет и Друштво математичара Србије. Овогодишње такмичење одржаће се у три категорије:

                1. презентација (на тему MR Worldwide – господин који ће ваше путовање учинити незаборавним!),

                2. апликативни програм/игрица (на тему Иновативни софтвер за унапређење физичког и/или менталног здравља),

                3. видео (на тему Страсти).

                За детаљније информације и о пропозицијама такмичења погледајте RAF Challenge 2025.  На финале такмичења позивају се средњошколци који уђу у ужи избор, а најбољи се награђују вредним наградама.  Пријаве и слање радова ће се обављати путем онлајн форме до 16. фебруара 2025. године, а планирано је да се финале такмичења одржи у суботу, 15. марта 2025. године.",
        ]);

        Blog::create([
            "naslov" => "Др Јелена Васиљевић представљала РАФ на конфернцији SCAI 2024 у Швајцарској",
            "sadrzaj" => "Ванредна професорка Рачунарског факултета др Јелена Васиљевић учествовала је као Invited Speaker, Keynote Speaker и Session Chair на 13th International Conference on Soft Computing, Artificial Intelligence and Applications (SCAI 2024) и представљала Рачунарски факултет. Конференција SCAI 2024 одржана је од 16. до 17. новембра у Цириху у Швајцарској.
            
            Др Јелена Васиљевић је као Invited Speaker представила цео свој научни рад са назнаком примене вештачке интелигенције (AI) у медицини и дијагностици карцинома. На конференцији је онлајн презентован и научни рад др Милоша Јовановића и докторанда Рачунарског факултета Игора Меденице."
        ]);
    }
}
